app/controllers/todo_controller.rb

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT 1  [["id", 1]]
---
    def show
        @t=Todo.find(params[:id])

INSERT INTO "todos" ("description", "pomodoros_estimate", "completed", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "Lunch"], ["pomodoros_estimate", 1], ["completed", "f"], ["created_at", "2018-08-19 18:23:51.297631"], ["updated_at", "2018-08-19 18:23:51.297631"]]
---
    def create
        t=Todo.new
        t.description=params[:description]
        t.pomodoros_estimate=params[:pomodoros_estimate]
        t.completed=false
        t.save

DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 11]]
---
    def destroy
        Todo.destroy(params[:id])

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT 1  [["id", 3]]
---
    def edit
        @t=Todo.find(params[:id])

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT 1  [["id", 7]]
UPDATE "todos" SET "pomodoros_estimate" = $1, "completed" = $2, "updated_at" = $3 WHERE "todos"."id" = $4  [["pomodoros_estimate", nil], ["completed", "f"], ["updated_at", "2018-08-19 21:26:43.864006"], ["id", 7]]
---
    def update
        t=Todo.find(params[:id])
        t.description=params[:description]
        t.pomodoros_estimate=params[:pomodoros_estimate]
        t.completed=false
        t.save